{
  "end_conversation": [
    {
      "tag": "goodbye",
      "patterns": [
        "Goodbye",
        "Bye",
        "See you later",
        "Talk to you soon",
        "Catch you later",
        "I have to go",
        "I'm done for now",
        "That's all for now",
        "Thanks, that's it",
        "Take care",
        "I'm leaving",
        "It's time for me to go",
        "I need to go now",
        "I'll see you next time",
        "See you around",
        "Until next time",
        "Farewell",
        "Bye for now",
        "Talk to you later",
        "I’ll chat with you later"
      ],
      "responses": [
        "Goodbye! Take care of yourself.",
        "Bye for now. Remember, I'm here if you need to talk.",
        "See you next time. Wishing you a wonderful day ahead!",
        "Talk to you soon. Stay safe and be well.",
        "Take care! Always here when you need me.",
        "Goodbye for now. Be kind to yourself.",
        "Bye! Remember, you're not alone.",
        "Catch you later! Stay strong.",
        "See you around! Take one step at a time.",
        "Until next time, remember to breathe and relax.",
        "Farewell! You’ve got this.",
        "Take care and have a great rest of your day!",
        "See you later. Be kind to yourself today.",
        "Goodbye for now! Stay safe and keep smiling.",
        "I'll be here when you need me again. Take care!",
        "Farewell! Have a peaceful day.",
        "Bye for now. Wishing you calm and clarity.",
        "Talk to you later! Keep taking those small steps.",
        "Goodbye! Always here for you.",
        "See you soon! Stay gentle with yourself."
      ]
    },
    {
      "tag": "thank_you",
      "patterns": [
        "Thank you",
        "Thanks a lot",
        "Thanks for your help",
        "I appreciate it",
        "I’m grateful",
        "Thanks so much",
        "I can’t thank you enough",
        "Thanks for being here",
        "Thanks for listening",
        "Thank you for helping",
        "I appreciate your support",
        "You’ve been helpful",
        "Thanks for everything",
        "Thanks for your time",
        "I’m thankful",
        "I’m really grateful",
        "Thank you for your kindness",
        "Thanks a ton",
        "I appreciate it so much",
        "Thank you for being supportive"
      ],
      "responses": [
        "You're very welcome! I'm glad I could help.",
        "It was my pleasure to assist you. Take care!",
        "You're welcome! Always happy to chat with you.",
        "I'm here whenever you need to talk. Take care!",
        "You’re welcome! I’m glad I could support you.",
        "I’m here for you anytime. Take care!",
        "Glad I could help! Remember, you’re doing great.",
        "You're welcome! Small steps make a big difference.",
        "Happy to help! Take good care of yourself.",
        "It’s my pleasure! I’m just a message away.",
        "You’re welcome! Wishing you peace and positivity.",
        "I’m here anytime you need me. Stay strong!",
        "Thank you for sharing with me. Take care!",
        "You’re welcome! I’m always here to listen.",
        "It’s always good to talk. Stay kind to yourself!",
        "I’m glad I could be helpful. Take things slow.",
        "Always happy to assist. You’re not alone.",
        "You’re welcome! Remember, you’re doing your best.",
        "It means a lot to hear that. Take care of yourself!",
        "I’m grateful for the chance to support you."
      ]
    },
    {
      "tag": "termination",
      "patterns": [
        "End chat",
        "I want to stop",
        "Can we end here?",
        "I think I’m done",
        "Stop",
        "Let’s finish up",
        "Wrap it up",
        "I’m ready to stop",
        "We can end now",
        "Pause the conversation",
        "Let’s stop here",
        "I need to end this chat",
        "Can we stop now?",
        "I think we’re done",
        "That’s all for today",
        "Let’s conclude here",
        "I’m done talking",
        "We can finish now",
        "Let’s finish this up",
        "It’s time to stop",
      ],
      "responses": [
        "Of course, we can stop here. Remember, I’m always here if you need to talk.",
        "Okay, we’ll end here for now. Take care of yourself!",
        "Sure, we can pause here. Wishing you well until next time!",
        "No problem, we can wrap up. Remember to be kind to yourself!",
        "Alright, we’ll conclude here. Stay safe and take care!",
        "I’ll be here when you’re ready to talk again. Take care!",
        "Okay, we’ll stop now. Wishing you peace and comfort.",
        "Sure, let’s end here. You’ve got this!",
        "We can stop here. Stay gentle with yourself.",
        "Alright, take care and reach out whenever you need to.",
        "Let’s wrap up for now. Be kind to yourself.",
        "It’s okay to pause here. I’ll be ready when you are.",
        "Ending here is fine. Remember to take a moment for yourself.",
        "We’ll stop here. Stay strong and take it one step at a time.",
        "Sure, we can conclude here. Wishing you clarity and peace.",
        "No worries, we’ll end for now. Take care and be safe.",
        "Let’s pause here. You’re doing great, remember that.",
        "Stopping now is okay. Be sure to rest and recharge.",
        "Alright, take care! I’ll always be here for you.",
        "We’ll conclude here. Wishing you calm and positivity."
      ]
    }
  ]
}
