{"intents": [
  {
    "tag": "anxiety",
    "patterns": [ 
      "difficulty relax", "restlessness", "tension","sleep difficulty", "difficulty concentrate", "race think",   "Rapid heartbeat", "palpitations", "irritability", "sweat", "overthinking", "nausea", "diarrhoea","tremble", "shake","excessive worry", "excessive fear","muscle tension","hypervigilance","feel trap",
      "panic attack", "feel overwhelm"
    ],
    "responses": [
      "Relaxation can be tough when anxiety takes over. Take a few moments to focus on relaxing your body",
      "It common to feel restless when you are anxious. use grounding yourself, short mindfulness exercise to calm your body, mind",
      "I know that feeling tense can make anxiety feel even worse. How about we try a simple body scan to release that tension",
      "If you having trouble sleeping because of worry, it might help to do a relaxation exercise right before bed",
      "When your mind is scattered, it hard to concentrate, See if you can bring you back to the present moment and focus on just one thing at a time",
      "Racing thoughts are really common with anxiety. try to focus on one thing at a time and give your mind a moment to rest",
      "racing heartbeat can be really unsettling. take a few deep breaths together to help slow your heart rate. Inhale for four seconds, hold for four, and exhale slowly",
      "Irritability can often be a sign of stress or anxiety. It might help to pause and take a moment for yourself. How are you feeling emotionally right now",
      "Sweating is a common physical response to anxiety.try focusing on relaxing your body, which can help calm those physical sensations",
      "Overthinking often happens when anxiety takes control. calm your mind and focus on the present.",
      "Shaking can happen when anxiety takes over, but it will pass. Try focusing on your breath—slowly inhale, hold for a few seconds, and then exhale to help relax your body",
      "Excessive worry often happens when anxiety is high. what is the main worry you are facing, and can we explore ways to address it step by step",
      "It completely understandable to feel fearful during moments of anxiety. focus on what on your control right now, starting with a deep breath to help calm your mind and body"
    ]
  },

 {
    "tag": "bad",
    "patterns": [
      "terrible", "worse", "mess", "worthless", "disappointment", "hopeless", "failure", "scar", "helpless", "fear", "lonliness", "isolation",
      "weak", "useless", "miserable", "ruin", "mistake", "fall apart", "blame", "wrong", "alone","bad"
    ],
    "responses": [
      "Do you want to talk more about it", "I am really sorry you feel that way. Can you tell me more about what happened? I would love to help make it better.",
      "That does not sound great! Let me know how I can assist or if you would like to talk about it", "It sounds like things have taken a turn for the worse. If there is anything I can do to help",
      "That does not sound ideal. If you would like, I can offer some solutions or simply listen.", "it might seem like things are not working out, but I am here to help. How can we move forward from here",
      "sorry to hear you are feeling disappointedthis way. Let try to figure out what went wrong and see if we can improve it"
    ]
  },

  {
    "tag": "depression",
    "patterns": [
      "persistent sadness", "low mood", "loss interest", "fatigue","low energy","feel worthless",
      "feel guilt","tearfulness", "frequent cry","concentration difficulty","difficulty make decisions",
      "appetite change", "weight gain", "weight loss", "sleep disturbances","insomnia","oversleeping","psychomotor agitation",
      "hopeless","recurrent think death", "social withdrawal", "low self-esteem","bad hygiene","self harm"
    ],
    "responses": [
      "I am really sorry you are feeling this way. Persistent sadness can be really hard to cope with. It is important to know that you are not alone, and talking about it can sometimes help. Would you like to share more about what has been on your mind?",
      "It sounds like you are having a tough time with your mood right now. Feeling low can be really draining. If you would like, I can suggest a few ways to help lift your spirits, or we can talk more about what has causing you to feel this way.",
      "It must be frustrating to lose interest in things that once brought you joy. When that happens, it is easy to feel disconnected. Do you want to talk about the things that used to excite you, or would you like some suggestions for small activities to ease back into?",
      "It sounds like you are feeling really tired, physically or emotionally. Fatigue can often come with stress or emotional strain. Sometimes it helps to take small breaks or practice some relaxation techniques. Would you like to try a quick relaxation exercise?",
      "Low energy can make everything feel much harder. Have you been able to get enough rest lately? Sometimes small changes in routine or incorporating a little physical activity can help recharge your energy levels. Would you like some tips?",
      "Feeling guilty can weigh heavily on your heart. Sometimes, it helps to ask ourselves if we have been too harsh on ourselves. Would you like to talk more about the specific situation you are feeling guilty about?",
      "It seems like you are going through a lot of emotional pain right now, and crying can be a natural release. It is okay to feel like this. Sometimes, crying helps to process those overwhelming emotions. Would you like to share more about what is making you feel this way?",
      "It seems like you are feeling overwhelmed right now, and frequent crying can be a way your body expresses that. It is okay to let it out, but if you would like, we can explore ways to manage your emotions. Would that be helpful?",
      "Struggling to concentrate can make everything feel even harder. Sometimes stress or overwhelming emotions can cloud our focus. Have you been able to take breaks or get some fresh air? Maybe we can try some focus exercises together.",
      "It sounds like making decisions is tough right now. When anxiety or stress builds up, it can be hard to know what is the best choice. Would you like to talk through the options together, or maybe take a step back and think about what is most important to you?",
      "It sounds like your appetite has been changing, which can be a sign of stress or emotional strain. Changes in eating habits often happen when we are feeling down. Would you like to talk about how your appetite has been changing, or how you have been feeling about food recently?",
      "I hear you are having trouble with sleep, whether it is falling asleep or sleeping too much. Sleep problems are common when we are stressed or feeling down. Maybe we can discuss some techniques to help you relax before bed. Would you like to try something together?",
      "I understand you are feeling restless or like you can not stay still. This can be really frustrating. Sometimes, physical activity like a walk or deep breathing exercises can help release that excess energy. Want to try something like that?",
      "I am really sorry you are feeling this way, and I am glad you reached out. It is really important to talk to someone you trust, whether it is a friend, family member, or a professional. If you are feeling like you are in immediate danger, please reach out to a helpline or a mental health professional",
      "Hopelessness can feel so overwhelming, like there is no way out. I want you to know that even in tough times, there are people who care about you and want to help. Do you want to talk about what is making you feel this way? Together, we can explore ways to find some hope again"
    ]
  },

  {
    "tag": "new",
    "patterns": [
      "start", "happen", "start recent", "unusual", "different", "odd feel", "unexpected", "new feel", "sudden change", "change notice", "first time", "strange feel", "start happen", "feel strange", "notice change", "new experience", "new situation"
    ],
      "responses": [
          "It looks like you are experiancing new feelings. The best thing to do with new feelings is contacting your GP for help",
          "It seems like you are experiencing some unfamiliar emotions. Reaching out to your GP is great for helpping understand these emotions.",
          "It sounds like you are facing new emotions. Consider calling or meeting with your GP for help."
      ]
  },
  {
    "tag": "manageable",
    "patterns": [
      "not bad", "could worse", "handle", "okay", "not great", "not unbearable", "manageable", "worse", "not terrible", "not worst", "under control", "not overwhelm", "worse", "still okay", "not fall apart", "mild", "feel stable", "hold", "fine"
    ],
    "responses": [
        "It looks like you are experiancing feelings that have been bothering you for some time so would be worth contacting your local mental health service for help",
        "It seems like you are experiencing some feelings that you have experianced before. Contacting a mental health service will help you understand what might trigger these emotions and help you control it.",
        "It sounds like you have suffered from this level of emotions before. We recommend you to consider calling a mental health service to help understand it better."
    ]
  },
  {
    "tag": "imediat_danger",
    "patterns": [
      "kill", "end life", "seriously hurt", "no reason live", "want die", "not go", "take life", "suicidal", "die soon", "life not worth", "hopeless", "not live anymore", "end everything", "unbearable pain", "not handle anymore", "no point live", "end everything"
    ],
    "responses": [
      "I am really sorry you are feeling this way. Please, reach out to 999 or 111 if not life threaterning. You are not alone.",
      "I am so sorry to hear you are feeling this way. Please do not hesitate to call 999 for urgent help, or 111 if it is not life-threatening. We are all here for you.",
      "I am very sorry to hear how you are feeling. Please reach out to 999 or 111 if it is not an emergency. You are not alone in this."
    ]
  },

  {
    "tag": "good",
    "patterns": [
      "happy", "great", "glad", "amaze", "excite", "awesome", "perfect", "wonderful", "fantastic", "amaze", "superb", "fabulous", "excite"
    ],
    "responses": [
      "I am glad to hear you are doing well! How can I assist you today?", "That is great to hear! Let me know how I can help you further.",
      "It is always good to know things are going well! What can I do for you?", "I am happy to hear that! Is there anything I can help you with right now?",
      "That is wonderful! How can I support you or make things even better today?"
    ]
  },

  {
    "tag": "greetings",
    "patterns": [
      "hello", "hey","hi","good day","Greetings","what is up","how is it going", "Good morning",
      "Good afternoon", "Good evening", "What is up", "How are you?", "How is it going?", "How do you do", 
      "I am back", "Need help", "Got time?", "need support" 
    ],
    "responses": [
      "Hello! How can I help you today?", "Hi there. What is on your mind?"
    ]
  },

  {
    "tag": "Short-term",
    "patterns": [
      "Stress", "overwhelm","Burnout","Nervous","Worry","Unmotivated","Sleepless", "Panic", 
      "Restless", "Irritable", "Procrastination", "overeat", "binge", "starve", "appetite loss", "Confusion", "fatigue", 
      "distract", "Headache", "Unease", "Frustration", "Breathlessness", "Forgetful", "withdrawal", "short term"
    ],
    "responses": [
      "sorry youre feeling this way right now", 
      "Has something specific happened recently that is made you feel this way", 
      "It sounds like you have been going through a tough time recently", 
      "I hear you. Lets try to figure out how to support you",
      "Do you feel like these feelings came on suddenly or have been building up?", 
      "It is okay to feel this way. These feelings can pass", 
      "You are not alone, and it is good that you are reaching out"
    ]
  },

  {
    "tag": "goodbye",
    "patterns": [
      "See ya", "see you later","bye","goodbye","have a nice day","bye bye"
    ],
    "responses": [
      "Goodbye!", "See you later.", "Please come back soon."
    ]
  },

  {
    "tag": "yes",
    "patterns": [
      "yes", "yeah", "yup", "yes bet", "absolutely", "certainly", "sure", 
      "definitely", "of course", "yes indeed", "right", "okay", "i agree", "without a doubt", "aye", "naturally", "affirmative", "totally", "exactly"
    ],
    "responses": [
      "great! lets work on this together. can you tell me more about how you are feeling right now", 
      "okay! would you like to try a breathing exercise or hear some tips for managing stress?", 
      "thank you for opening up. it is a brave step to seek help."
    ]
  },
  
  {
    "tag": "no",
    "patterns": [
      "no", " no way", "absolutely not", "definately not", "not at all", "not really", "nope", "never", 
      "i do not think so", "nah", "negative", "i ca not", "i am afraid not", "not posible", " no chance", "not in a million years", 
      "that is a no", "i disagree", "not likely", "i wo not"
    ],
    "responses": [
      "contact your local crisis team at antelope house", "contact community mental health team at cannon house", 
      "online support available with any mind matter", "solent mind, provides services including peer support groups and telephone support lines"
    ]
  },
  
  {
    "tag": "mental health",
    "patterns": [
      "do you have resources for dealing with depression or anxiety?",
      "where is my nearest social services", "where can I find mental health support?",
      "what mental health services are available?", "i need help with anxiety or depression",
      "what is the process for mental health treatment?",
      "can you recommend a therapist near me", "how do i contact a mental health professional?", 
      "how do I get mental health treatment?", "where can i find support for anxiety?", "i need help with my mental health", 
      "are there any psychologists available online?", "what is the number for a mental health hotline?"
    ],
    "responses": [
      "you are not alone in this", "your feelings are valid", "i am sorry you are feeling this way", 
      "i am proud of you for talking about it", "you do not have to go through this by yourself",
      "i understand. Let me share some options for support, like speaking to a professional or exploring coping strategies. What feels right for you?",
      "it is important to take care of your mental health. i can help you find a counselor or therapist. would that work for you?",
    "if you feel like you are in a crisis, please do not hesitate to call a helpline. i can help you find one in your area. would you like me to do that?"
    ]
  }
]}
